export const COMPLAINT_CLASSIFICATIONS = [
  "Специфические качества", "Пищевая безопасность", "Обслуживание", "Доставка", "Упаковка", "Колл центр", "Кухня"
];

export const CLASSIFICATION_SECTIONS = [
  "Вкус", "Запах", "Внешний вид", "Пищевое отравление", "Инородное тело", "Аллергические реакции", 
  "Обслуживание официанта", "Обслуживание хостеса", "Обслуживание менеджера", "Обслуживание сотрудника зала", 
  "Сроки доставки", "Состояние продукта при доставке", "Обслуживание курьера", "Перепутаница", 
  "Не доставлен вообще", "Недоложили", "Вид упаковки", "Информационная технология", 
  "Обслуживание колл центра", "Долгая, отдача", "Обслуживание регулировщика"
];

export const BRANCH_NAMES = [
  "ТАРАС ШЕВЧЕНКО", "НОВЗА", "БОТКИНО", "НЕКСТ", "КУЙЛЮК", "БУХАРА", "УЧТЕПА", 
  "МЕГАПОЛИС", "ДАРК КИТЧЕН", "БАДАМЗАР", "ШОТА РУСТАВЕЛИ", "АБАЙ", "РУДАКИ", 
  "ФЭМИЛИ ПАРК", "АВИАТОР", "СЕРГЕЛИ", "ЦУМ", "ОФИС", "ФЕРГАНА", "РИВЬЕРА", 
  "САГБАН", "САЙРАМ", "ДЕПО МОЛЛ", "УТКА ЗАВОДСКАЯ", "КОЛЛ ЦЕНТР", "ХАЙ ТАУН", 
  "ИБН СИНО", "МИРАБАД", "АНДИЖАН", "ДЖИЗАХ", "ЯНГИЮЛЬ", "ЧИРЧИК", "ТТЗ"
];

export const SOURCES = [
  "Книга отзывов и обращений", "БОТ", "Инстаграм маркетинг", "Инстаграм HR", 
  "Офис", "Узум тезкор", "Яндекс еда", "Инстаграм ген директора", 
  "Колл центр", "Потребитель.uz", "Телефон в ОКиПБ", "Телеграм чат", "QR code"
];

export const DEADLINE_STATUSES = [
  "Выполнен в срок", "Просроченно выполнен", "Вообще не выполнен"
];

export const MOTIVATION_STATUSES = [
  "Маркетинг", "IT", "HR (Найм)", "HR (Oбучение)", "HR (Kультура)", 
  "ОКПБ", "Операционный отдел", "Колл центр", "Доставка (Курьеры)", 
  "Технический отдел", "Юридический отдел", "Служба безопасности"
];

export const COMPLAINT_STATUSES = [
  "Критическая", "Средняя", "Низкая"
];
